Revit 2024 API
ElevationMarker Class
 ElevationMarkers either host elevation ViewSection views or view references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class ElevationMarker : Element
Visual Basic
Public Class ElevationMarker _
	Inherits Element
Visual C++
public ref class ElevationMarker : public Element
Remarks
 ElevationMarkers store the ViewFamilyType which will be used by all elevations hosted on the ElevationMarker. The orientation of an ElevationMarker is determined by the orientation of the views it hosts. You can check the orientation of any view by getting View.ViewDirection. To reorient the ElevationMarker and all of the views it hosts, call ElementTransformUtils.RotateElement with the ElevationMarker as an argument.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElevationMarker
See Also
ElevationMarker Members
Autodesk.Revit.DB Namespace